{
    "Profile": {
        "First": "Richard",
        "Last": "Sarkis",
        "Gender": "male",
        "Headline": "Founder & Executive Chairman at Reonomy",
        "Location": "No Location",
        "Followers": "1,973 followers",
        "Bio": "Building great things at Reonomy..."
    },
    "Education": {
        "School": [
            "Reonomy",
            "The Wharton School",
            "Williams College",
            "Andrea Geroldi",
            "Sam Lavery",
            "Tahlia S."
        ],
        "Degree": [
            "9 yrs 7 mos",
            "MBA, Strategic Management",
            "BA, Economics, Psychology",
            "Culture & Team Builder |  Supporter of Leaders |  Connector  |  Learner",
            "Staff Product Designer at Juniper Square",
            "Director, Human Resources at Rippling"
        ],
        "Date": [
            "May 2020 - Present · 2 yrs 4 mos",
            "2005 - 2007",
            "1997 - 2001",
            "March 8, 2021, Richard managed Andrea directly",
            "December 19, 2018, Richard managed Sam directly",
            "June 29, 2016, Richard managed Tahlia directly"
        ]
    },
    "Expierence": {
        "Expierence": [
            "Unlock Real Estate",
            "McKinsey & Company",
            "The Boston Consulting Group",
            "Rich Moon Technologies"
        ],
        "Date": [
            "2021 - Present · 1 yr 8 mos",
            "Sep 2007 - Feb 2013 · 5 yrs 6 mos",
            "Jun 2006 - Aug 2006 · 3 mos",
            "2003 - 2005 · 2 yrs"
        ]
    },
    "User Posts": {
        "post_dates": [
            "9 months ago",
            "1 year ago",
            "1 year ago",
            "1 year ago",
            "1 year ago",
            "1 year ago",
            "2 years ago",
            "2 years ago",
            "2 years ago",
            "2 years ago",
            "2 years ago",
            "2 years ago",
            "2 years ago",
            "3 years ago",
            "3 years ago",
            "3 years ago",
            "3 years ago",
            "3 years ago",
            "3 years ago",
            "3 years ago",
            "3 years ago",
            "3 years ago",
            "3 years ago",
            "3 years ago",
            "3 years ago",
            "4 years ago",
            "4 years ago",
            "4 years ago",
            "4 years ago",
            "5 years ago",
            "5 years ago",
            "5 years ago",
            "5 years ago",
            "5 years ago",
            "6 years ago",
            "6 years ago",
            "6 years ago",
            "6 years ago",
            "7 years ago",
            "7 years ago",
            "7 years ago",
            "7 years ago",
            "7 years ago",
            "7 years ago",
            "7 years ago",
            "7 years ago",
            "7 years ago",
            "7 years ago",
            "7 years ago",
            "7 years ago",
            "7 years ago",
            "8 years ago",
            "8 years ago",
            "8 years ago",
            "8 years ago",
            "8 years ago"
        ],
        "post_texts": [
            "Wow what an amazing achievement by team Reonomy!Could not be more proud or excited to share the incredible news that we are joining forces with Altus Group to form a true company of consequence in the CRE space.I am so thankful to all Reonomists past and present, our investors that have supported us from Day 1, our customers and our many partners.   And a special thanks to my partner in building and running this amazing company full of amazing people over the last few years Bill Okun.  👏This has been an incredible journey and it's only just beginning!Onwards!!!🤩",
            "Excited to share the virtual stage with my friend  Sam Yen!  JPMorgan Chase & Co. continues to be the best of business partners to Reonomy and I look forward to chatting about it next week!",
            "Everyone knows that 2020 was deeply challenging for broad swaths of the commercial real estate ecosystem. Despite these macro headwinds, Reonomy has grown its relationships with many brokerage firms as our solutions and products have become more deeply embedded across these organizations while creating demonstrable value.We're excited to announce our latest partnership with eXp World Holdings and their growing commercial arm.  Congrats to the team on another great achievement and welcome to our newest customer!",
            "This is a huge milestone for Reonomy!   So proud of all our team for this amazing validation of all the hard work they continue to put in!  💪We've been working with JPMorgan Chase & Co. for a number of years now and I'm so excited to grow our relationship with them in such a meaningful way.  They continue to be the best of partners.Plenty more to come...  🤩",
            "I finally made it!  I'm a cockroach!  🤣🤣🤣",
            "Huge milestone for the team at Reonomy and the CRE industry in general!Feedback has already been amazing for those clients that have gotten early access.  Can't wait to roll this out to everyone...",
            "Great job by team Reonomy!!!",
            "Some exciting personal and professional news! Most of you know that I’ve been looking for a partner to help me scale Reonomy into a company of consequence for over 8 years now. When I managed to convince Bill Okun to step into the business full-time after two years on our Board, I hoped that he would be the partner that I’ve been looking for. Over the last few quarters, that hope has been replaced by absolute conviction and certainty that Bill is the right partner to help us on the amazing journey that we are on at Reonomy.That’s why I am thrilled to announce that I am stepping up to a new full-time role as Executive Chairman, with Bill assuming the role of CEO. I’ve known Bill for almost 7 years (thanks for the intro Brooks Gibbins and Gareth Jones!) and I know that he will do a fantastic job focusing on daily execution and management of the team while I focus on our clients, strategy and partnerships.Thanks Bill and look forward to all that we’ll accomplish together!Come join us!  :)",
            "Time for words is over.  It's time for action.  Reonomy and all Reonomists stand in solidarity with the Black community against race-based violence and racism.We must level the playing field.",
            "Great stuff by the Reonomy team!  Insights are more important than ever now.Don't get left behind!",
            "🤤🤤🤤",
            "According to our research, activity within the land asset class is especially impressive in secondary markets– namely in the Greater Denver, Las Vegas, Phoenix, Salt Lake City, and Austin MSAs. Read more on our blog: https://bit.ly/37Lx4Th",
            "Reonomy’s on a journey to be the world’s source of property intelligence.Today I’m excited to share a big step in that journey, announcing our $60 million Series D round of funding, led by Georgian Partners with participation from Wells Fargo and Citi.  We’ve come a long way from our first closet office in Midtown and I’m grateful to all of the amazing Reonomists, past and present, clients and partners that have supported us to get to where we are today.I also want to take the chance to thank all of our investors including Sapphire Ventures, LLC, Bain Capital Ventures, and Primary Venture Partners for their continued support.This is an important milestone for us, but we're only just getting started!",
            "Super proud of our amazing teams here at Reonomy! This landmark new product is enabling our customers to unlock huge value as part of their day to day workflows.Check it our for yourselves!",
            "Great insights and visualizations by team Reonomy here!Blown away by the great content that keeps get cranked out...#visualizations #insights #cretech",
            "Crucial to empower everyone to unleash their inner entrepreneur!Been doing it here at Reonomy and the results have been astounding.Here's a little piece that I wrote about this...",
            "Great insight by Reonomy VP of Product Patrick Rafferty in this article...  Definitely worth a read!NYC data is definitely an outlier...",
            "Sam Viskovich rapidly taking over the air waves!",
            "Love this team!",
            "Creating a data standard for this massive asset class wasn't our intent when we started Reonomy but sometimes you just gotta go big!  Excited for where this industry is headed... #data #standard #cretech",
            "To be able to count CBRE as a Reonomy enterprise client is both exciting and humbling.  They have been an absolute pleasure to work with and I'm looking forward to deepening our partnership in the years to come...Onwards!Not sure about that baby analogy though! 👶 😂",
            "What a great profile of Reonomy and some of our leaders by Built In NYC!I'm continually inspired by this amazing group that helps shape what we do on a daily basis.  Thank you Bhaskar M., Maureen Teyssier, Michael Manne and all other Reonomists past and present for joining me on this journey!#inspiration",
            "What a great way to start the year!  Thrilled to be working with Michael Manne, Bhaskar M. and Maureen Teyssier!  Three amazing additions to the team at Reonomy.This is going to be a huge year for us!",
            "Go team Reonomy!",
            "I first met Mark and Jonathan five years ago and I was immediately struck by their deep knowledge of the CRE data ecosystem.  I've learned a ton from them over the years and I'm proud to call them and all the folks at Meridian Capital Group partners.Hear more about how they leverage the Reonomy platform as part of their commitment to building a world class solution for the CRE debt space. Here's to the next five years!",
            "Finally an article I wrote without my face all over it!  #realestate #realestatedevelopment #fintech",
            "Wow!  What an amazing time I had chatting to the legendary Arthur Levitt on Bloomberg.  He's such a wealth of wisdom and experience.I got to share what we've been up to at Reonomy over the past few years - the good, bad and ugly of it...  I hope you enjoy it.#fintech",
            "Come join the party...All the cool kids are doing it!  #commercialrealestate",
            "Proud day for team Reonomy today.  It's been a true five year overnight success story!  😂Firstly, thanks to our investors including Sapphire Ventures, LLC, Bain Capital Ventures, SoftBank Capital, and others for the continued support.  I'm also humbled by the amazing support from all our clients.  We're looking forward to using this new funding to continue to revolutionize the world of commercial real estate data and tech.And last but not least thanks to all past, present and future (we're hiring!) Reonomists for joining me on this journey so far.  Here's to the next five years!    #funding #commercialrealestate #dataanalysis",
            "From 320,000 properties to 47 million: what I learned from successfully scaling Reonomy's national CRE data platform:",
            "Reonomy cracks the top 10!",
            "Torches and pitchforks at the ready...",
            "The way that property managers and owners market their properties today is radically different today than it was 10 years ago. Staying ahead of the latest tech trends helps owners and developers attract and retain the best tenants.",
            "Great to see early adopters of our national platform like Christian get so much value out of it!",
            "Great piece by Reonomy's own Elizabeth Young:",
            "Reonomy is about to take our NYC offering national.  Join our team, ship fast and make an impact.  java, scala, python https://lnkd.in/efD-vjk",
            "Tune in tonight at 6pm to a brand new episode of the Dealmaker Zone. We go behind the scenes at Reonomy and hear from CEO and Co-Founder,  Richard Sarkis. He shares his thoughts on his company, the future of the CRE Tech Space and why Reonomy is poised to dominate it's industry.Channel 33 on Fios, 82 on RCN, 34 and 1995 on TWC. You can stream it live at 6pm here https://lnkd.in/dJhAJgi.",
            "Lenders are slowing starting to raise rates and tighten underwriting. For those that were planning to refi in the next 6-12 months but were waiting since rates weren't rising anyway should reconsider and start getting quotes now. You can down load the Eastern Union App and track the rates live and daily.",
            "2016 is approaching fast & we are growing! We're hiring for a number of exciting Sales roles! 2016 is going to be a BIG year at Reonomy. Get on board!",
            "Reonomy is growing & we are hiring for quite a few roles including many for our Sales Team! Want to be part of something big? We'd love to hear from you! https://lnkd.in/eYxd-XAKnow anyone who may be interested? Tag them, share this post, or send them my email at bcheung@reonomy.com!",
            "Looking to join a Tech startup with a strong product market fit? We are hiring an AE! http://bit.ly/1VnaQiG",
            "We're looking to grow the team! https://lnkd.in/eD949eM",
            "#reonomy is on the search for a superstar Office Manager to join our amazing team! https://lnkd.in/egDMFhE",
            "Reonomy has a brand new look! Check out our new website >> www.reonomy.com",
            "#Reonomy is searching for a Business Development Representative to join our sales team!",
            "Reach the right owner, more often. Reonomy has made BIG changes to the way we gather and present ownership information, giving our users richer and more precise owner and contact details, presented in a way that is easy to read and act on. Read more to find out we've done and how we did it! http://bit.ly/1eMo8kY",
            "Reonomy is searching for a stellar Office Manager to join the team! http://linkd.in/1IZE79X",
            "Want to solve tough tech problems everyday? Reonomy is looking for talented Software Engineers for our Customer Team https://lnkd.in/dMUJiw9",
            "Help us take on tough problems in machine learning and scalable data processing using technologies like Scala, Python, Postgres, ElasticSearch, Mesos and Docker.",
            "Ensure accuracy, quality and delivery speed of data intensive Software platform   https://lnkd.in/euBvzzw",
            "Tremendous opportunity at a rapidly growing Engineering driven company!",
            "Big Data, Personalization, NLP, Machine Learning, Node.js, Python, and a great team!",
            "Reonomy is growing! We are hiring an Office Manager who will help build & shape our office, culture, people & operations! If you know any superstar Office Managers with prior experience within a tech startup please share this with them! https://lnkd.in/eQp-rvs",
            "We have an exciting opportunity for a talented Product Owner! https://lnkd.in/b2v3fb4",
            "Reonomy is hiring a Marketing Communications Director with CRE &/or SaaS experience! https://lnkd.in/dkhSShJ",
            "Nice piece from my friend Josh Guttman about RE Tech"
        ],
        "post_likes": [
            "196",
            "43",
            "47",
            "164",
            "189",
            "98",
            "83",
            "289",
            "67",
            "32",
            "19",
            "8",
            "99",
            "66",
            "31",
            "14",
            "9",
            "9",
            "17",
            "31",
            "93",
            "37",
            "14",
            "9",
            "47",
            "9",
            "13",
            "29",
            "194",
            "15",
            "15",
            "15",
            0,
            "15",
            "6",
            0,
            "9",
            0,
            "1",
            "2",
            "1",
            "4",
            0,
            "17",
            "3",
            "7",
            0,
            "1",
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            "4"
        ],
        "post_comments": [
            "48 comments",
            "3 comments",
            "1 comment",
            "8 comments",
            "15 comments",
            "4 comments",
            "2 comments",
            "38 comments",
            "2 comments",
            0,
            "3 comments",
            0,
            "14 comments",
            "4 comments",
            "5 comments",
            "1 comment",
            0,
            "1 comment",
            "2 comments",
            "3 comments",
            "18 comments",
            "1 comment",
            "1 comment",
            0,
            0,
            0,
            0,
            "1 comment",
            "30 comments",
            "1 comment",
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0
        ],
        "media_type": [
            "Other: Poll, Shared Post, etc",
            "Other: Poll, Shared Post, etc",
            "Other: Poll, Shared Post, etc",
            "Other: Poll, Shared Post, etc",
            "Other: Poll, Shared Post, etc",
            "Other: Poll, Shared Post, etc",
            "Other: Poll, Shared Post, etc",
            "Other: Poll, Shared Post, etc",
            "Other: Poll, Shared Post, etc",
            "Other: Poll, Shared Post, etc",
            "Other: Poll, Shared Post, etc",
            "Other: Poll, Shared Post, etc",
            "Other: Poll, Shared Post, etc",
            "Other: Poll, Shared Post, etc",
            "Other: Poll, Shared Post, etc",
            "Other: Poll, Shared Post, etc",
            "Other: Poll, Shared Post, etc",
            "Other: Poll, Shared Post, etc",
            "Other: Poll, Shared Post, etc",
            "Other: Poll, Shared Post, etc",
            "Other: Poll, Shared Post, etc",
            "Other: Poll, Shared Post, etc",
            "Other: Poll, Shared Post, etc",
            "Other: Poll, Shared Post, etc",
            "Other: Poll, Shared Post, etc",
            "Other: Poll, Shared Post, etc",
            "Other: Poll, Shared Post, etc",
            "Other: Poll, Shared Post, etc",
            "Other: Poll, Shared Post, etc",
            "Other: Poll, Shared Post, etc",
            "Other: Poll, Shared Post, etc",
            "Other: Poll, Shared Post, etc",
            "Other: Poll, Shared Post, etc",
            "Other: Poll, Shared Post, etc",
            "Other: Poll, Shared Post, etc",
            "Other: Poll, Shared Post, etc",
            "Image",
            "Other: Poll, Shared Post, etc",
            "Other: Poll, Shared Post, etc",
            "Image",
            "Other: Poll, Shared Post, etc",
            "Other: Poll, Shared Post, etc",
            "Other: Poll, Shared Post, etc",
            "Other: Poll, Shared Post, etc",
            "Other: Poll, Shared Post, etc",
            "Other: Poll, Shared Post, etc",
            "Other: Poll, Shared Post, etc",
            "Other: Poll, Shared Post, etc",
            "Other: Poll, Shared Post, etc",
            "Other: Poll, Shared Post, etc",
            "Other: Poll, Shared Post, etc",
            "Other: Poll, Shared Post, etc",
            "Other: Poll, Shared Post, etc",
            "Other: Poll, Shared Post, etc",
            "Other: Poll, Shared Post, etc",
            "Other: Poll, Shared Post, etc"
        ],
        "media_links": [
            "None",
            "None",
            "None",
            "None",
            "None",
            "None",
            "None",
            "None",
            "None",
            "None",
            "None",
            "None",
            "None",
            "None",
            "None",
            "None",
            "None",
            "None",
            "None",
            "None",
            "None",
            "None",
            "None",
            "None",
            "None",
            "None",
            "None",
            "None",
            "None",
            "None",
            "None",
            "None",
            "None",
            "None",
            "None",
            "None",
            "https://media-exp1.licdn.com/dms/image/C4D22AQFCLROSR5lhIg/feedshare-shrink_800/0/1583333791936?e=1663200000&v=beta&t=ml-jl4k0YRlH_2eGSmWuO7PJrxhTjo_CQ81_zTupOhk",
            "None",
            "None",
            "https://media-exp1.licdn.com/dms/image/C5122AQFVSkmpmKumzA/feedshare-shrink_800/0/1584377198616?e=1663200000&v=beta&t=03GdDw_ZR3ANRVpm40MCR8njvJIPo2mvzTefMc8Z5z4",
            "None",
            "None",
            "None",
            "None",
            "None",
            "None",
            "None",
            "None",
            "None",
            "None",
            "None",
            "None",
            "None",
            "None",
            "None",
            "None"
        ]
    }
}